# Задача:
 ## Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

 ## Решение:
 ### 1.Обьявлено два массива array1 и array2. 
 ### 2.Реализован метод SecondArray для создания подходящего под условие массива:
 #### В методе цикл со счетчиком, "пробегающийся" по первому массиву, при условии, если счетчик не превысил его длину. Пробегаясь, он чекает каждый элемент на удовлетворение условию, и если элемент подходит под условие, добавляет его в array2. Созданная заранее переменная count для того, чтобы определять на какое место во втором массиве ставить элемент, так же увеличивается с каждой итерацией цикла.

 ### 3.Печать массива - метод printArray:
 #### Внутри - цикл со четчиком. Пока счетчик меньше длины массива, каждый элемент выводится одной итерацией цикла посредством Console.Write.